---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.FootingWillMoveToBottom
source: html/dfb56eb2-d8e0-bbc9-c89e-ba206aa7eb22.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.FootingWillMoveToBottom Property

An attached Structural Foundation will be moved to the bottom of the Column.

## Syntax (C#)
```csharp
public static FailureDefinitionId FootingWillMoveToBottom { get; }
```